# Starting with JupySQL

In [1]:
## Installing using pip
!pip install jupysql --quiet

In [2]:
## Loading the extension in Jupyter Lab
%load_ext sql

In [3]:
## Connecting to a database
## %sql dialect://username:password@host:port/database
%sql mysql://root:***@127.0.0.1:3306/datatest

# Performing ETL using JupySQL

## Heart Disease dataset

1. **id**: ID patient 
2. **age**: Age in years
3. **sex**: Sex (**1** = male; **0** = female)
4. **cp**: Chest pain type (**1** = typical angina, **2** = atypical angina, **3** = non-anginal pain, **4** = asymptomatic)
5. **trestbps**: Resting blood pressure (in mm Hg on admission to the hospital)
6. **chol**: Serum cholesterol in mg/dl 6 fbs: (fasting blood sugar > 120 mg/dl) (**1** = true; **0** = false)
7. **fbs**: Fasting blood sugar > 120 mg/dl (**1** = true; **0** = false)
8. **restecg**: Resting electrocardiographic results (**0** = normal, **1** = having ST-T wave abnormality (T wave inversions and/or ST elevation or depression of > 0.05 mV), **2** = showing probable or definite left ventricular hypertrophy by Estes' criteria)
9. **thalach**: Maximum heart rate achieved
10. **exang**: Exercise induced angina (**1** = yes; **0** = no)
11. **oldpeak**: ST depression induced by exercise relative to rest
12. **slope**: The slope of the peak exercise ST segment (**1** = upsloping, **2** = flat, **3** = downsloping)
13. **ca**: Number of major vessels (0-3) colored by fluoroscopy
14. **thal**: **3** = normal; **6** = fixed defect; **7** = reversible defect  
15. **target**: **1** indicating that the patient has heart disease and **0** indicating that they do not.

## Extracting data

### Pandas

In [4]:
## Pandas
import pandas as pd
data0 = pd.read_csv('heart_disease.csv', sep=';')
data0.head()

,id,age,sex,cp,trestbps,chol,fbs,restecg,thalach,exang,oldpeak,slope,ca,thal
0,1,63,1,3,145,233,1,0,150,0,2.3,0,0,1
1,2,37,1,2,130,250,0,1,187,0,3.5,0,0,2
2,3,41,0,1,130,204,0,0,172,0,1.4,2,0,2
3,4,56,1,1,120,236,0,1,178,0,0.8,2,0,2
4,5,57,0,0,120,354,0,1,163,1,0.6,2,0,2

In [5]:
data0.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 303 entries, 0 to 302
Data columns (total 14 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   id        303 non-null    int64
 1   age       303 non-null    int64
 2   sex       303 non-null    int64
 3   cp        303 non-null    int64
 4   trestbps  303 non-null    int64
 5   chol      303 non-null    int64
 6   fbs       303 non-null    int64
 7   restecg   303 non-null    int64
 8   thalach   303 non-null    int64
 9   exang     303 non-null    int64
 10  oldpeak   303 non-null    float64
 11  slope     303 non-null    int64
 12  ca        303 non-null    int64
 13  thal      303 non-null    int64
dtypes: float64(1), int64(13)
memory usage: 33.3 KB

In [ ]:
##data0.info()
##data0.isnull().sum()

In [ ]:
##data0.describe()

### JupySQL

In [6]:
## JupySQL
data1 = %sql SELECT * FROM heart_disease

Running query in 'mysql://root:***@127.0.0.1:3306/datatest'

303 rows affected.

In [7]:
data1

+----+-----+-----+----+----------+------+-----+---------+---------+-------+---------+-------+----+------+
| id | age | sex | cp | trestbps | chol | fbs | restecg | thalach | exang | oldpeak | slope | ca | thal |
+----+-----+-----+----+----------+------+-----+---------+---------+-------+---------+-------+----+------+
| 1  |  63 |  1  | 3  |   145    | 233  |  1  |    0    |   150   |   0   |   2.3   |   0   | 0  |  1   |
| 2  |  37 |  1  | 2  |   130    | 250  |  0  |    1    |   187   |   0   |   3.5   |   0   | 0  |  2   |
| 3  |  41 |  0  | 1  |   130    | 204  |  0  |    0    |   172   |   0   |   1.4   |   2   | 0  |  2   |
| 4  |  56 |  1  | 1  |   120    | 236  |  0  |    1    |   178   |   0   |   0.8   |   2   | 0  |  2   |
| 5  |  57 |  0  | 0  |   120    | 354  |  0  |    1    |   163   |   1   |   0.6   |   2   | 0  |  2   |
| 6  |  57 |  1  | 0  |   140    | 192  |  0  |    1    |   148   |   0   |   0.4   |   1   | 0  |  1   |
| 7  |  56 |  0  | 1  |   140    | 294  |  0  |    0    |   153   |   0   |   1.3   |   1   | 0  |  2   |
| 8  |  44 |  1  | 1  |   120    | 263  |  0  |    1    |   173   |   0   |   0.0   |   2   | 0  |  3   |
| 9  |  52 |  1  | 2  |   172    | 199  |  1  |    1    |   162   |   0   |   0.5   |   2   | 0  |  3   |
| 10 |  57 |  1  | 2  |   150    | 168  |  0  |    1    |   174   |   0   |   1.6   |   2   | 0  |  2   |
+----+-----+-----+----+----------+------+-----+---------+---------+-------+---------+-------+----+------+

In [8]:
%%sql data2 <<
SELECT * FROM heart_disease

Running query in 'mysql://root:***@127.0.0.1:3306/datatest'

303 rows affected.

In [9]:
##Python dataframe
df_python = data2.DataFrame()

In [10]:
df_python.head()

,id,age,sex,cp,trestbps,chol,fbs,restecg,thalach,exang,oldpeak,slope,ca,thal
0,1,63,1,3,145,233,1,0,150,0,2.3,0,0,1
1,2,37,1,2,130,250,0,1,187,0,3.5,0,0,2
2,3,41,0,1,130,204,0,0,172,0,1.4,2,0,2
3,4,56,1,1,120,236,0,1,178,0,0.8,2,0,2
4,5,57,0,0,120,354,0,1,163,1,0.6,2,0,2

## Transforming Data and Loading Data

#####################

### Pandas - Rename columns

In [11]:
# Rename columns
df0 = data0.rename(columns={'age': 'age_patient'})  # Pandas

In [12]:
df0.head()

,id,age_patient,sex,cp,trestbps,chol,fbs,restecg,thalach,exang,oldpeak,slope,ca,thal
0,1,63,1,3,145,233,1,0,150,0,2.3,0,0,1
1,2,37,1,2,130,250,0,1,187,0,3.5,0,0,2
2,3,41,0,1,130,204,0,0,172,0,1.4,2,0,2
3,4,56,1,1,120,236,0,1,178,0,0.8,2,0,2
4,5,57,0,0,120,354,0,1,163,1,0.6,2,0,2

### JupySQL - Rename Columns

In [13]:
%%sql
CREATE VIEW data AS
SELECT age AS age_patient, sex, cp, trestbps, chol, fbs, restecg, thalach, exang, oldpeak, slope, ca, thal
FROM heart_disease

Running query in 'mysql://root:***@127.0.0.1:3306/datatest'

++
||
++
++

In [14]:
%%sql 
select * from data

Running query in 'mysql://root:***@127.0.0.1:3306/datatest'

303 rows affected.

+-------------+-----+----+----------+------+-----+---------+---------+-------+---------+-------+----+------+
| age_patient | sex | cp | trestbps | chol | fbs | restecg | thalach | exang | oldpeak | slope | ca | thal |
+-------------+-----+----+----------+------+-----+---------+---------+-------+---------+-------+----+------+
|      63     |  1  | 3  |   145    | 233  |  1  |    0    |   150   |   0   |   2.3   |   0   | 0  |  1   |
|      37     |  1  | 2  |   130    | 250  |  0  |    1    |   187   |   0   |   3.5   |   0   | 0  |  2   |
|      41     |  0  | 1  |   130    | 204  |  0  |    0    |   172   |   0   |   1.4   |   2   | 0  |  2   |
|      56     |  1  | 1  |   120    | 236  |  0  |    1    |   178   |   0   |   0.8   |   2   | 0  |  2   |
|      57     |  0  | 0  |   120    | 354  |  0  |    1    |   163   |   1   |   0.6   |   2   | 0  |  2   |
|      57     |  1  | 0  |   140    | 192  |  0  |    1    |   148   |   0   |   0.4   |   1   | 0  |  1   |
|      56     |  0  | 1  |   140    | 294  |  0  |    0    |   153   |   0   |   1.3   |   1   | 0  |  2   |
|      44     |  1  | 1  |   120    | 263  |  0  |    1    |   173   |   0   |   0.0   |   2   | 0  |  3   |
|      52     |  1  | 2  |   172    | 199  |  1  |    1    |   162   |   0   |   0.5   |   2   | 0  |  3   |
|      57     |  1  | 2  |   150    | 168  |  0  |    1    |   174   |   0   |   1.6   |   2   | 0  |  2   |
+-------------+-----+----+----------+------+-----+---------+---------+-------+---------+-------+----+------+

#####################

### Pandas - Convert data types

In [15]:
data0[['sex','cp','fbs', 'restecg','exang','slope','ca','thal']] = data0[['sex','cp','fbs', 'restecg','exang','slope','ca','thal']].astype('category') # Pandas

In [16]:
data0.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 303 entries, 0 to 302
Data columns (total 14 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   id        303 non-null    int64
 1   age       303 non-null    int64
 2   sex       303 non-null    category
 3   cp        303 non-null    category
 4   trestbps  303 non-null    int64
 5   chol      303 non-null    int64
 6   fbs       303 non-null    category
 7   restecg   303 non-null    category
 8   thalach   303 non-null    int64
 9   exang     303 non-null    category
 10  oldpeak   303 non-null    float64
 11  slope     303 non-null    category
 12  ca        303 non-null    category
 13  thal      303 non-null    category
dtypes: category(8), float64(1), int64(5)
memory usage: 17.9 KB

In [17]:
data0.describe()

               id         age    trestbps        chol     thalach     oldpeak
count  303.000000  303.000000  303.000000  303.000000  303.000000  303.000000
mean   152.000000   54.366337  131.623762  246.264026  149.646865    1.039604
std     87.612784    9.082101   17.538143   51.830751   22.905161    1.161075
min      1.000000   29.000000   94.000000  126.000000   71.000000    0.000000
25%     76.500000   47.500000  120.000000  211.000000  133.500000    0.000000
50%    152.000000   55.000000  130.000000  240.000000  153.000000    0.800000
75%    227.500000   61.000000  140.000000  274.500000  166.000000    1.600000
max    303.000000   77.000000  200.000000  564.000000  202.000000    6.200000

In [18]:
data0.describe(include='category')

        sex   cp  fbs  restecg  exang  slope   ca  thal
count   303  303  303      303    303    303  303   303
unique    2    4    2        3      2      3    5     4
top       1    0    0        1      0      2    0     2
freq    207  143  258      152    204    142  175   166

### JupySQL - Convert data types

In [19]:
%config SqlMagic.displaylimit = 100

In [20]:
%%sql 
DESCRIBE heart_disease

Running query in 'mysql://root:***@127.0.0.1:3306/datatest'

14 rows affected.

+----------+--------+------+-----+---------+-------+
|  Field   |  Type  | Null | Key | Default | Extra |
+----------+--------+------+-----+---------+-------+
|    id    |  int   | YES  |     |   None  |       |
|   age    |  int   | YES  |     |   None  |       |
|   sex    |  int   | YES  |     |   None  |       |
|    cp    |  int   | YES  |     |   None  |       |
| trestbps |  int   | YES  |     |   None  |       |
|   chol   |  int   | YES  |     |   None  |       |
|   fbs    |  int   | YES  |     |   None  |       |
| restecg  |  int   | YES  |     |   None  |       |
| thalach  |  int   | YES  |     |   None  |       |
|  exang   |  int   | YES  |     |   None  |       |
| oldpeak  | double | YES  |     |   None  |       |
|  slope   |  int   | YES  |     |   None  |       |
|    ca    |  int   | YES  |     |   None  |       |
|   thal   |  int   | YES  |     |   None  |       |
+----------+--------+------+-----+---------+-------+

In [21]:
%%sql
CREATE VIEW data02 AS
SELECT age, trestbps, chol, thalach, oldpeak,
CAST(sex AS CHAR(2)) as sex, CAST(cp AS CHAR(2)) as cp, 
CAST(fbs AS CHAR(2)) as fbs, CAST(restecg AS CHAR(2)) as restecg,
CAST(exang AS CHAR(2)) as exang, CAST(slope AS CHAR(2)) as slope,
CAST(ca AS CHAR(2)) as ca, CAST(thal AS CHAR(2)) as thal
FROM heart_disease

Running query in 'mysql://root:***@127.0.0.1:3306/datatest'

++
||
++
++

In [22]:
%%sql 
DESCRIBE data02

Running query in 'mysql://root:***@127.0.0.1:3306/datatest'

13 rows affected.

+----------+------------+------+-----+---------+-------+
|  Field   |    Type    | Null | Key | Default | Extra |
+----------+------------+------+-----+---------+-------+
|   age    |    int     | YES  |     |   None  |       |
| trestbps |    int     | YES  |     |   None  |       |
|   chol   |    int     | YES  |     |   None  |       |
| thalach  |    int     | YES  |     |   None  |       |
| oldpeak  |   double   | YES  |     |   None  |       |
|   sex    | varchar(2) | YES  |     |   None  |       |
|    cp    | varchar(2) | YES  |     |   None  |       |
|   fbs    | varchar(2) | YES  |     |   None  |       |
| restecg  | varchar(2) | YES  |     |   None  |       |
|  exang   | varchar(2) | YES  |     |   None  |       |
|  slope   | varchar(2) | YES  |     |   None  |       |
|    ca    | varchar(2) | YES  |     |   None  |       |
|   thal   | varchar(2) | YES  |     |   None  |       |
+----------+------------+------+-----+---------+-------+

#####################

### Female older than 55 years

### Pandas - Filter data

In [23]:
data_female55 = data0[(data0['sex'] == 0) & (data0['age'] > 55)]  # Pandas

In [24]:
data_female55.head()

,id,age,sex,cp,trestbps,chol,fbs,restecg,thalach,exang,oldpeak,slope,ca,thal
4,5,57,0,0,120,354,0,1,163,1,0.6,2,0,2
6,7,56,0,1,140,294,0,0,153,0,1.3,1,0,2
14,15,58,0,3,150,283,1,0,162,0,1.0,2,0,2
16,17,58,0,2,120,340,0,1,172,0,0.0,2,0,2
17,18,66,0,3,150,226,0,1,114,0,2.6,0,0,2

### JupySQL - Filter data

In [25]:
%%sql 
CREATE VIEW data_female55 AS
SELECT * FROM heart_disease
WHERE sex = 0 and age > 55;  # JupySQL

Running query in 'mysql://root:***@127.0.0.1:3306/datatest'

++
||
++
++

In [26]:
%%sql
select * from data_female55
limit 10

Running query in 'mysql://root:***@127.0.0.1:3306/datatest'

10 rows affected.

+----+-----+-----+----+----------+------+-----+---------+---------+-------+---------+-------+----+------+
| id | age | sex | cp | trestbps | chol | fbs | restecg | thalach | exang | oldpeak | slope | ca | thal |
+----+-----+-----+----+----------+------+-----+---------+---------+-------+---------+-------+----+------+
| 5  |  57 |  0  | 0  |   120    | 354  |  0  |    1    |   163   |   1   |   0.6   |   2   | 0  |  2   |
| 7  |  56 |  0  | 1  |   140    | 294  |  0  |    0    |   153   |   0   |   1.3   |   1   | 0  |  2   |
| 15 |  58 |  0  | 3  |   150    | 283  |  1  |    0    |   162   |   0   |   1.0   |   2   | 0  |  2   |
| 17 |  58 |  0  | 2  |   120    | 340  |  0  |    1    |   172   |   0   |   0.0   |   2   | 0  |  2   |
| 18 |  66 |  0  | 3  |   150    | 226  |  0  |    1    |   114   |   0   |   2.6   |   0   | 0  |  2   |
| 20 |  69 |  0  | 3  |   140    | 239  |  0  |    1    |   151   |   0   |   1.8   |   2   | 2  |  2   |
| 26 |  71 |  0  | 1  |   160    | 302  |  0  |    1    |   162   |   0   |   0.4   |   2   | 2  |  2   |
| 29 |  65 |  0  | 2  |   140    | 417  |  1  |    0    |   157   |   0   |   0.8   |   2   | 1  |  2   |
| 39 |  65 |  0  | 2  |   155    | 269  |  0  |    1    |   148   |   0   |   0.8   |   2   | 0  |  2   |
| 40 |  65 |  0  | 2  |   160    | 360  |  0  |    0    |   151   |   0   |   0.8   |   2   | 0  |  2   |
+----+-----+-----+----+----------+------+-----+---------+---------+-------+---------+-------+----+------+

#####################

### Mean age by gender and chest pain type

### Pandas - Aggregate data

In [27]:
data_sex_age_cp = data0.groupby(['sex', 'cp'])['age'].mean()  # Pandas

In [28]:
data_sex_age_cp

sex  cp
0    0     57.256410
     1     51.944444
     2     54.971429
     3     63.250000
1    0     55.105769
     1     51.031250
     2     52.538462
     3     54.315789
Name: age, dtype: float64

### JupySQl - Aggregate data

In [29]:
%%sql 
CREATE VIEW data_sex_age_cp AS
SELECT sex, cp,
AVG(age) as mean_age
FROM heart_disease
GROUP BY sex, cp  # JupySQL

Running query in 'mysql://root:***@127.0.0.1:3306/datatest'

++
||
++
++

In [30]:
%%sql
SELECT * FROM data_sex_age_cp
order by sex, cp

Running query in 'mysql://root:***@127.0.0.1:3306/datatest'

8 rows affected.

+-----+----+----------+
| sex | cp | mean_age |
+-----+----+----------+
|  0  | 0  | 57.2564  |
|  0  | 1  | 51.9444  |
|  0  | 2  | 54.9714  |
|  0  | 3  | 63.2500  |
|  1  | 0  | 55.1058  |
|  1  | 1  | 51.0313  |
|  1  | 2  | 52.5385  |
|  1  | 3  | 54.3158  |
+-----+----+----------+

### Pandas - Combine data

In [31]:
data_target = pd.read_csv('heart_disease_target.csv', sep=';')
data_target.head()

   id  target
0   1       1
1   2       1
2   3       1
3   4       1
4   5       1

In [33]:
Data_target = data0.merge(data_target, how='left', on='id')  # Pandas

In [34]:
Data_target.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 303 entries, 0 to 302
Data columns (total 15 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   id        303 non-null    int64
 1   age       303 non-null    int64
 2   sex       303 non-null    category
 3   cp        303 non-null    category
 4   trestbps  303 non-null    int64
 5   chol      303 non-null    int64
 6   fbs       303 non-null    category
 7   restecg   303 non-null    category
 8   thalach   303 non-null    int64
 9   exang     303 non-null    category
 10  oldpeak   303 non-null    float64
 11  slope     303 non-null    category
 12  ca        303 non-null    category
 13  thal      303 non-null    category
 14  target    303 non-null    int64
dtypes: category(8), float64(1), int64(6)
memory usage: 22.5 KB

In [ ]:
data0.groupby(['sex', 'cp'])['age'].mean()

### JupySQL - Combine data

In [35]:
%%sql 
CREATE VIEW data_final_target AS
SELECT A.id, A.age, A.sex, A.cp, A.trestbps, A.chol, A.fbs, A.restecg, A.thalach, A.exang, 
A.oldpeak, A.slope, A.ca, A.thal, B.target  
FROM heart_disease A, heart_disease_target B
WHERE A.id = B.id # JupySQL

Running query in 'mysql://root:***@127.0.0.1:3306/datatest'

++
||
++
++

In [36]:
%%sql
SELECT target,
COUNT(id) as freq_target_patient
FROM data_final_target
GROUP BY target # JupySQL

Running query in 'mysql://root:***@127.0.0.1:3306/datatest'

2 rows affected.

+--------+---------------------+
| target | freq_target_patient |
+--------+---------------------+
|   1    |         165         |
|   0    |         138         |
+--------+---------------------+